Script started on Tue 12 Feb 2013 03:48:37 PM PST
[?1034hbash-4.1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-50.el6)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/l/amunishk/private/cmps012b/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005a4: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/l/amunishk/private/cmps012b/lab5/list2 foo bar

Breakpoint 1, main (argc=3, argv=0x7fffffffdf68) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) prit[Knt argc
$1 = 3
(gdb) print argv
$2 = (char **) 0x7fffffffdf68
(gdb) print are[Kgv[0]
$3 = 0x7fffffffe2a3 "/afs/cats.ucsc.edu/users/l/amunishk/private/cmps012b/lab5/list2"
(gdb) print argv[0][1P]1]
$4 = 0x7fffffffe2e3 "foo"
(gdb) print argv[1][1P]2]
$5 = 0x7fffffffe2e7 "bar"
(gdb) print argv[2][1P]3]
$6 = 0x0
(gdb) print argv[3][1P]4]
$7 = 0x7fffffffe2eb "ORBIT_SOCKETDIR=/tmp/orbit-amunishk"
(gdb) print argv[4][1P]5]
$8 = 0x7fffffffe30f "HOSTNAME=be-linux30.ic.ucsc.edu"
(gdb) print argv[5][1P]6]
$9 = 0x7fffffffe32f "AUTOLOGOUT=180"
(gdb) quit
A debugging session is active.

	Inferior 1 [process 5679] will be killed.

Quit anyway? (y or n) y
bash-4.1$ exit
exit

Script done on Tue 12 Feb 2013 03:50:18 PM PST
